export const QUESTIONS = [
  { id:1, topic:"Алгоритм", q:"Алгоритм дегеніміз не?", options:[
    "Кез келген мәтін", "Мәселені шешу үшін орындалатын нақты қадамдар тізбегі",
    "Құрылғы", "Тек бағдарлама тілі"
  ], answer:1 },

  { id:2, topic:"Айнымалы", q:"Айнымалының қызметі қандай?", options:[
    "Компьютерді өшіру", "Мәліметті сақтау және кейін қолдану", "Тек мәтін шығару", "Желі қосу"
  ], answer:1 },

  { id:3, topic:"Логика", q:"'AND' операциясы қашан ақиқат?", options:[
    "Кемінде бір шарт ақиқат", "Екі шарт та ақиқат", "Әрқашан жалған", "Тек бір шарт тексеріледі"
  ], answer:1 },

  { id:4, topic:"Шарт", q:"if операторы не үшін керек?", options:[
    "Қате түзету", "Шартқа қарай әртүрлі әрекет орындау", "Тек дизайн", "Файл өшіру"
  ], answer:1 },

  { id:5, topic:"Цикл", q:"Цикл не үшін қолданылады?", options:[
    "Қайталау үшін", "Бір рет орындау үшін", "Сурет үшін", "Жады тазалау үшін"
  ], answer:0 },

  { id:6, topic:"Математика/цикл", q:"1-ден 5-ке дейінгі қосынды қанша?", options:["10","12","15","20"], answer:2 },

  { id:7, topic:"Тізім", q:"Тізім (list) дегеніміз не?", options:[
    "Бір сан", "Элементтер жиыны", "Тек файл", "Протокол"
  ], answer:1 },

  { id:8, topic:"Функция", q:"Функцияның артықшылығы қандай?", options:[
    "Кодты қайта қолдану, құрылымдау", "Экран әдемі ету", "Интернет жылдамдату", "Қате көбейту"
  ], answer:0 },

  { id:9, topic:"Қате", q:"SyntaxError нені білдіреді?", options:[
    "Логика қате", "Интернет жоқ", "Синтаксистік қате", "Компьютер бұзылды"
  ], answer:2 },

  { id:10, topic:"Қате", q:"Логикалық қате белгісі?", options:[
    "Бағдарлама ашылмайды", "Жұмыс істейді, бірақ нәтиже дұрыс емес", "Компилятор жоқ", "Файл сақталмады"
  ], answer:1 },

  { id:11, topic:"Салыстыру", q:"a=7. Қай шарт ақиқат?", options:["a < 7","a == 7","a != 7","a <= 6"], answer:1 },

  { id:12, topic:"Дерек", q:"Кіріс дерегі өзгерсе нәтиже де өзгеруі мүмкін. Бұл нені көрсетеді?", options:[
    "Әрқашан бірдей нәтиже", "Нәтиже кіріске тәуелді", "Компьютер қате", "Тек мәтін өзгереді"
  ], answer:1 }
];
